atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/socket_driver.c
static void do_send_socket_error(Context *ctx, err_t status)
{
    GlobalContext *glb = ctx->global;
    struct SocketData *socket_data = ctx->platform_data;
    if (socket_data->active) {
        // udp active sockets do not send errors
        if (socket_data->type != UDPSocket) {
            // {tcp_error, {Moniker :: atom(), Socket :: pid(), Module :: module()}, Reason :: atom()}
            if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(3) + TUPLE_SIZE(3)) != MEMORY_GC_OK)) {
                AVM_ABORT();
            }
            term reason_atom = lwip_error_atom(glb, status);
            term result_tuple = term_alloc_tuple(3, &ctx->heap);
            term_put_tuple_element(result_tuple, 0, globalcontext_make_atom(glb, tcp_error_atom));
            term socket_pid = term_from_local_process_id(ctx->process_id);
            term socket_wrapper = create_tcp_socket_wrapper(socket_pid, &ctx->heap, glb);
            term_put_tuple_element(result_tuple, 1, socket_wrapper);
            term_put_tuple_element(result_tuple, 2, reason_atom);
            globalcontext_send_message(glb, socket_data->controlling_process_pid, result_tuple);
        }
    } else {
        do_send_error_reply(ctx, status, socket_data->passive_ref_ticks, socket_data->passive_receiver_process_pid);
        socket_data->passive_receiver_process_pid = 0;
        socket_data->passive_ref_ticks = 0;
    }
}

static void do_send_tcp_closed(Context *ctx)
{
    GlobalContext *glb = ctx->global;
    struct SocketData *socket_data = ctx->platform_data;
    if (socket_data->active) {
        // {tcp_closed, {Moniker :: atom(), Socket :: pid(), Module :: module()}}
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2) + TUPLE_SIZE(3)) != MEMORY_GC_OK)) {
            AVM_ABORT();
        }
        term result_tuple = term_alloc_tuple(2, &ctx->heap);
        term_put_tuple_element(result_tuple, 0, TCP_CLOSED_ATOM);
        term socket_pid = term_from_local_process_id(ctx->process_id);
        term socket_wrapper = create_tcp_socket_wrapper(socket_pid, &ctx->heap, glb);
        term_put_tuple_element(result_tuple, 1, socket_wrapper);
        globalcontext_send_message(glb, socket_data->controlling_process_pid, result_tuple);
    } else {
        if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2) + REPLY_SIZE) != MEMORY_GC_OK)) {
            AVM_ABORT();
        }
        term error_tuple = term_alloc_tuple(2, &ctx->heap);
        term_put_tuple_element(error_tuple, 0, ERROR_ATOM);
        term_put_tuple_element(error_tuple, 1, CLOSED_ATOM);
        do_send_passive_reply(ctx, socket_data, error_tuple);
    }
}

static void do_tcp_server_netconn_event(Context *ctx)
{
    TRACE("do_tcp_server_netconn_event\n");
    struct TCPServerSocketData *tcp_data = ctx->platform_data;

    struct ListHead *accepter_head;
    struct ListHead *tmp;
    struct TCPServerAccepter *accepter = NULL;
    MUTABLE_LIST_FOR_EACH (accepter_head, tmp, &tcp_data->accepters_list_head) {
        accepter = GET_LIST_ENTRY(accepter_head, struct TCPServerAccepter, accepter_head);
        list_remove(accepter_head);
    }

    if (accepter) {
        accept_conn(ctx, tcp_data, accepter->ref_ticks, accepter->accepting_process_pid);
        free(accepter);
    } else {
        tcp_data->ready_connections++;
    }
}

static NativeHandlerResult do_receive_data(Context *ctx)
{
    // Common case where socket is active or passive receiver is waiting
    struct netbuf *buf = NULL;
    struct SocketData *socket_data = ctx->platform_data;
    err_t status = netconn_recv(socket_data->conn, &buf);
    if (status != ERR_OK) {
        if (socket_data->type == TCPClientSocket) {
            // Close socket in case of errors or finish closing if it's closed
            // on the other end.
            struct ESP32PlatformData *platform = ctx->global->platform_data;
            synclist_remove(&platform->sockets, &socket_data->sockets_head);
            if (UNLIKELY(netconn_close(socket_data->conn) != ERR_OK)) {
                TRACE("do_receive_data: netconn_close failed\n");
            }
            if (UNLIKELY(netconn_delete(socket_data->conn) != ERR_OK)) {
                TRACE("do_receive_data: netconn_delete failed\n");
            }
            socket_data->conn = NULL;
        }
        if (socket_data->type == TCPClientSocket && (status == ERR_CLSD || status == ERR_CONN)) {
            do_send_tcp_closed(ctx);
        } else {
            TRACE("do_receive_data: netconn_recv error: %i\n", status);
            // Send an error packet.
            do_send_socket_error(ctx, status);
        }
        return NativeTerminate;
    }

    // This only retrieves the first chunk of buf
    netbuf_first(buf);
    void *data;
    u16_t data_len;
    status = netbuf_data(buf, &data, &data_len);
    if (UNLIKELY(status != ERR_OK)) {
        TRACE("do_receive_data: netbuf_data error: %i\n", status);
        do_send_socket_error(ctx, status);
        return NativeContinue;
    }
    socket_data->avail_bytes -= data_len;
    socket_data->read_condition = false;

    TRACE("%*s\n", (int) data_len, (char *) data);

    int recv_terms_size;
    if (socket_data->binary) {
        recv_terms_size = term_binary_heap_size(data_len);
    } else {
        recv_terms_size = data_len * 2;
    }

    int tuples_size;
    if (socket_data->active) {
        // tuples_size = 4 (result_tuple size)
        // add 3-tuple for {Moniker :: atom(), Socket :: pid(), Module :: module()}
        tuples_size = TUPLE_SIZE(3) + TUPLE_SIZE(3);
    } else {
        // tuples_size = 3 (ok_tuple size)
        tuples_size = TUPLE_SIZE(2) + REPLY_SIZE;
    }
    if (socket_data->type == UDPSocket) {
        // {<ip_addr>, port, packet}
        tuples_size += SOCKET_INET_ADDR + TUPLE_SIZE(3);
    }
    if (UNLIKELY(memory_ensure_free(ctx, tuples_size + recv_terms_size) != MEMORY_GC_OK)) {
        AVM_ABORT();
    }

    term recv_data;
    if (socket_data->binary) {
        recv_data = term_create_uninitialized_binary(data_len, &ctx->heap, ctx->global);
        memcpy((void *) term_binary_data(recv_data), data, data_len);
    } else {
        recv_data = term_from_string((const uint8_t *) data, data_len, &ctx->heap);
    }
    term recv_term;
    if (socket_data->type == UDPSocket) {
        term addr_term = socket_addr_to_tuple(&ctx->heap, netbuf_fromaddr(buf));
        if (addr_term == term_invalid_term()) {
            TRACE("do_receive_data: socket_addr_to_tuple error\n");
            do_send_socket_error(ctx, ERR_BUF);
            return NativeContinue;
        }
        term port = term_from_int32(netbuf_fromport(buf));
        recv_term = term_alloc_tuple(3, &ctx->heap);
        term_put_tuple_element(recv_term, 0, addr_term);
        term_put_tuple_element(recv_term, 1, port);
        term_put_tuple_element(recv_term, 2, recv_data);
    } else {
        recv_term = recv_data;
    }

    if (netbuf_next(buf) == 0) {
        TRACE("do_receive_data: netbuf error : got more parts\n");
        do_send_socket_error(ctx, ERR_BUF);
        return NativeContinue;
    }

    netbuf_delete(buf);


    if (socket_data->active) {
        term active_tuple = term_alloc_tuple(socket_data->type == TCPClientSocket ? 3 : 5, &ctx->heap);
        term_put_tuple_element(active_tuple, 0, socket_data->type == TCPClientSocket ? TCP_ATOM : UDP_ATOM);
        term socket_pid = term_from_local_process_id(ctx->process_id);
        term socket_wrapper =
            socket_data->type == UDPSocket ?
                create_udp_socket_wrapper(socket_pid, &ctx->heap, ctx->global) :
                create_tcp_socket_wrapper(socket_pid, &ctx->heap, ctx->global);
        term_put_tuple_element(active_tuple, 1, socket_wrapper);
        if (socket_data->type == TCPClientSocket) {
            term_put_tuple_element(active_tuple, 2, recv_term);
        } else {
            term_put_tuple_element(active_tuple, 2, term_get_tuple_element(recv_term, 0));
            term_put_tuple_element(active_tuple, 3, term_get_tuple_element(recv_term, 1));
            term_put_tuple_element(active_tuple, 4, recv_data);
        }
        globalcontext_send_message(ctx->global, socket_data->controlling_process_pid, active_tuple);
        TRACE("sent received to active process (pid=%d): ", (int) socket_data->controlling_process_pid);
        #ifdef ENABLE_TRACE
            term_display(stdout, active_tuple, ctx);
        #endif
        TRACE("\n");
    } else {
        term ok_tuple = term_alloc_tuple(2, &ctx->heap);
        term_put_tuple_element(ok_tuple, 0, OK_ATOM);
        term_put_tuple_element(ok_tuple, 1, recv_term);
        do_send_passive_reply(ctx, socket_data, ok_tuple);
        TRACE("sent received to passive caller (pid=%d): ", (int) socket_data->passive_receiver_process_pid);
        #ifdef ENABLE_TRACE
            term_display(stdout, ok_tuple, ctx);
        #endif
        TRACE("\n");
    }

    return NativeContinue;
}

