atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/socket_driver.c
    if (UNLIKELY(memory_ensure_free(ctx, REPLY_SIZE) != MEMORY_GC_OK)) {
        AVM_ABORT();
    }
    do_send_reply(ctx, OK_ATOM, ref_ticks, pid);
}

void do_udp_open(Context *ctx, const GenMessage *gen_message)
{
    GlobalContext *glb = ctx->global;
    struct ESP32PlatformData *platform = glb->platform_data;

    int32_t pid = term_to_local_process_id(gen_message->pid);
    uint64_t ref_ticks = term_to_ref_ticks(gen_message->ref);
    if (UNLIKELY(term_get_tuple_arity(gen_message->req) != 2)) {
        ESP_LOGW(TAG, "Received invalid message.");
        return;
    }
    term params = term_get_tuple_element(gen_message->req, 1);

    term port_term = interop_proplist_get_value(params, PORT_ATOM);
    term binary_term = interop_proplist_get_value_default(params, BINARY_ATOM, FALSE_ATOM);
    term active_term = interop_proplist_get_value_default(params, ACTIVE_ATOM, TRUE_ATOM);
    term controlling_process_term = interop_proplist_get_value(params, CONTROLLING_PROCESS_ATOM);

    bool ok = term_is_pid(controlling_process_term);
    if (UNLIKELY(!ok)) {
        do_send_error_reply(ctx, ERR_ARG, ref_ticks, pid);
        return;
    }
    int32_t controlling_process_pid = term_to_local_process_id(controlling_process_term);
    avm_int_t port = term_to_int(port_term);
    bool active = bool_term_to_bool(active_term, &ok);
    if (UNLIKELY(!ok)) {
        do_send_error_reply(ctx, ERR_ARG, ref_ticks, pid);
        return;
    }
    bool binary = bool_term_to_bool(binary_term, &ok);
    if (UNLIKELY(!ok)) {
        do_send_error_reply(ctx, ERR_ARG, ref_ticks, pid);
        return;
    }

    // Lock list of sockets before the event callback is called
    struct ListHead *sockets = socket_data_preinit(platform);
    struct netconn *conn = netconn_new_with_proto_and_callback(NETCONN_UDP, 0, socket_callback);
    if (IS_NULL_PTR(conn)) {
        fprintf(stderr, "failed to open conn\n");
        AVM_ABORT();
    }

    struct UDPSocketData *udp_data = udp_socket_data_new(ctx, conn, sockets, controlling_process_pid);
    socket_data_postinit(platform);
    if (IS_NULL_PTR(udp_data)) {
        AVM_ABORT();
    }
    udp_data->socket_data.active = active;
    udp_data->socket_data.binary = binary;

    if (port != 0) {
        err_t status = netconn_bind(conn, IP_ADDR_ANY, port);
        if (UNLIKELY(status != ERR_OK)) {
            do_send_error_reply(ctx, status, ref_ticks, pid);
            return;
        }
    }

    ip_addr_t naddr;
    u16_t nport;
    err_t status = netconn_getaddr(conn, &naddr, &nport, 1);
    if (UNLIKELY(status != ERR_OK)) {
        do_send_error_reply(ctx, status, ref_ticks, pid);
        return;
    }
    udp_data->socket_data.port = nport;

    if (UNLIKELY(memory_ensure_free(ctx, REPLY_SIZE) != MEMORY_GC_OK)) {
        AVM_ABORT();
    }
    do_send_reply(ctx, OK_ATOM, ref_ticks, pid);
}

// Required for compatibility with existing erlang libraries
// TODO: remove this when not required anymore
static void do_init(Context *ctx, const GenMessage *gen_message)
{
    if (UNLIKELY(term_get_tuple_arity(gen_message->req) < 2)) {
        ESP_LOGW(TAG, "Received invalid message.");
        return;
    }
    term params = term_get_tuple_element(gen_message->req, 1);

    if (interop_proplist_get_value_default(params, LISTEN_ATOM, FALSE_ATOM) == TRUE_ATOM) {
        TRACE("listen\n");
        do_listen(ctx, gen_message);

    } else if (interop_proplist_get_value_default(params, CONNECT_ATOM, FALSE_ATOM) == TRUE_ATOM) {
        TRACE("connect\n");
        do_connect(ctx, gen_message);

    } else if (interop_proplist_get_value_default(params, PROTO_ATOM, FALSE_ATOM) == UDP_ATOM) {
        TRACE("udp_open\n");
        do_udp_open(ctx, gen_message);
    }
}

static void do_send(Context *ctx, const GenMessage *gen_message)
{
    struct TCPServerSocketData *tcp_data = ctx->platform_data;

    int32_t pid = term_to_local_process_id(gen_message->pid);
    uint64_t ref_ticks = term_to_ref_ticks(gen_message->ref);

    if (UNLIKELY(term_get_tuple_arity(gen_message->req) != 2)) {
        ESP_LOGW(TAG, "Received invalid message.");
        return;
    }
    term data = term_get_tuple_element(gen_message->req, 1);

    size_t buffer_size;
    const void *buffer;
    void *buffer_copy = NULL;
    if (term_is_binary(data)) {
        // No need to copy.
        buffer_size = term_binary_size(data);
        buffer = term_binary_data(data);
    } else {
        switch (interop_iolist_size(data, &buffer_size)) {
            case InteropOk:
                break;
            case InteropMemoryAllocFail:
                if (UNLIKELY(memory_ensure_free(ctx, REPLY_SIZE) != MEMORY_GC_OK)) {
                    AVM_ABORT();
                }
                do_send_reply(ctx, OUT_OF_MEMORY_ATOM, ref_ticks, pid);
                return;
            case InteropBadArg:
                if (UNLIKELY(memory_ensure_free(ctx, REPLY_SIZE) != MEMORY_GC_OK)) {
                    AVM_ABORT();
                }
                do_send_reply(ctx, BADARG_ATOM, ref_ticks, pid);
                return;
        }
        buffer_copy = malloc(buffer_size);
        switch (interop_write_iolist(data, buffer_copy)) {
            case InteropOk:
                break;
            case InteropMemoryAllocFail:
                free(buffer_copy);
                if (UNLIKELY(memory_ensure_free(ctx, REPLY_SIZE) != MEMORY_GC_OK)) {
                    AVM_ABORT();
                }
                do_send_reply(ctx, OUT_OF_MEMORY_ATOM, ref_ticks, pid);
                return;
            case InteropBadArg:
                free(buffer_copy);
                if (UNLIKELY(memory_ensure_free(ctx, REPLY_SIZE) != MEMORY_GC_OK)) {
                    AVM_ABORT();
                }
                do_send_reply(ctx, BADARG_ATOM, ref_ticks, pid);
                return;
        }
        buffer = buffer_copy;
    }
    err_t status = netconn_write(tcp_data->socket_data.conn, buffer, buffer_size, NETCONN_COPY);
    free(buffer_copy);

